CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/trace_util/sl_wisun_trace_util.c
/***************************************************************************//**
 * @file
 * @brief
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include <assert.h>
#include <string.h>
#include <stdlib.h>
#include "sl_sleeptimer.h"
#include "sl_wisun_trace_util.h"
#include "sl_wisun_types.h"
#include "rail_config.h"
#include "cmsis_os2.h"

#if defined(SL_CATALOG_FREERTOS_KERNEL_PRESENT)
// FreeRTOS
  #include "FreeRTOS.h"
#else
// MicriumOS
  #include "sl_memory_manager.h"
#endif

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------

///  Size of the IPv6 string
#define IPV6_STRING_SIZE                (40U)

/// Empty IPv6 string
#define IPV6_EMPTY_STRING               "::"

/// Max length of the string of the phy
#define PHY_STR_MAX_LENGTH              (24U)

/// String of the FAN1.0
#define FAN_1_0_STR                     "FAN1.0"

/// String of the FAN1.1
#define FAN_1_1_STR                     "FAN1.1"

/// Print format string for FAN 1.0
#define FAN10_FORMAT_STR                "%s-%u-%x (%s)"

/// Print format string for FAN 1.0
#define FAN11_FORMAT_STR                "%s-%u-%u (%s)"

/// FAN 1.0 version
#define VERSION_WISUN_FAN1_0             0U

/// FAN 1.1 version
#define VERSION_WISUN_FAN1_1             1U

/// FSK PHY mode to operating mode table size
#define FSK_PHY_MODE_TO_OPM_TABLE_SIZE   9U

/// PHY mode minimum value
#define PHY_MODE_MIN_VAL                 1U

/// PHY mode minimum value
#define PHY_MODE_MAX_VAL                 8U

/// MAC address srting length
#define MAC_ADDR_STR_LEN \
  ((SL_WISUN_MAC_ADDRESS_SIZE * 2) + SL_WISUN_MAC_ADDRESS_SIZE - 1)

/// Allocate phy list element and return on error macro function
#define __alloc_phy_list_element_and_check(__dst_ptr, __phy_cfg_ptr) \
  do {                                                               \
    (__dst_ptr) = _alloc_phy_list_element(__phy_cfg_ptr);            \
    if (__dst_ptr == NULL) {                                         \
      return NULL;                                                   \
    }                                                                \
  } while (0)

/// Length of the timestamp buffer
#define TIMESTAMP_BUF_LEN     32U

/// Time stamp format string
#define TIMESTAMP_FORMAT  "%03d-%02d:%02d:%02d"

/// Milisecs in Secs
#define MS_IN_SEC         1000U

/// Secs in Day
#define SEC_IN_DAY        86400U

/// Secs in Hour
#define SEC_IN_HOUR       3600U

/// Secs in Minute
#define SEC_IN_MINUTE     60U

/// Trace util event notify max channel count
#define APP_WISUN_TRACE_UTIL_EVT_NOTIFY_MAX_CHS         31U

/// Trace util event notify error mask
#define APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ERROR_MSK       (1UL << 31U)

/// Trace util event notify all flags mask
#define APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ALL_FLAGS_MSK   0x7FFFFFFFUL

/// PHY type enumeration
typedef enum phy_type {
  /// PHY type FSK
  PHY_TYPE_FSK = 0,
  /// PHY type FSK FEC
  PHY_TYPE_FSK_FEC,
  /// PHY type OFDM1
  PHY_TYPE_OFDM1,
  /// PHY type OFDM2
  PHY_TYPE_OFDM2,
  /// PHY type OFDM3
  PHY_TYPE_OFDM3,
  /// PHY type OFDM4
  PHY_TYPE_OFDM4,
} phy_type_t;

/// RAIL to Wi-SUN OFDM PHY mode ID map element
typedef struct rail_ofdm_phy_mode_id {
  /// RAIL PHY mode ID
  uint8_t rail_phy_mode_id;
  /// Wi-SUN PHY mode ID min
  uint8_t wisun_phy_mode_id_min;
  /// Wi-SUN PHY mode ID max
  uint8_t wisun_phy_mode_id_max;
} rail_ofdm_phy_mode_id_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------

/**************************************************************************//**
 * @brief Get string key by value from app_enum_t
 * @details Helper function
 * @param[in] app_enum Application enum storage
 * @param[in] val Reference value
 * @return const char* String value
 *****************************************************************************/
static const char *_get_str_key_by_val_from_enum(const app_enum_t * const app_enum,
                                                 const uint32_t val);

/**************************************************************************//**
 * @brief Allocate PHY list element
 * @details Helper function
 * @param[in] phy_cfg PHY config to copy
 * @return app_wisun_phy_list_t* Allocated element ptr or NULL on error
 *****************************************************************************/
static app_wisun_phy_list_t *_alloc_phy_list_element(sl_wisun_phy_config_t *phy_cfg);

/**************************************************************************//**
 * @brief Getting PHY config by channel config entry
 * @details Getting available PHY's configuration by channel config entry
 * @param[in] ch_config_entry channel config
 * @param[out] phy_config pointer of destination of getting
 * @return sl_status_t SL_STATUS_OK if it is successful, otherwise SL_STATUS_FAIL
 *****************************************************************************/
static sl_status_t _get_phy_cfg_from_ch_cfg_entry(const RAIL_ChannelConfigEntry_t * const ch_config_entry,
                                                  sl_wisun_phy_config_t * const phy_config);

/**************************************************************************//**
 * @brief Get PHY type
 * @details Helper function
 * @param[in] phy_mode_id PHY mode ID
 * @return uint8_t PHY type
 *****************************************************************************/
__STATIC_INLINE uint8_t _get_phy_type(const uint8_t phy_mode_id);

/**************************************************************************//**
 * @brief Get PHY mode
 * @details Helper function
 * @param[in] phy_mode_id PHY mode ID
 * @return uint8_t PHY mode
 *****************************************************************************/
__STATIC_INLINE uint8_t _get_phy_mode(const uint8_t phy_mode_id);

/**************************************************************************//**
 * @brief Is FSK PHY
 * @details Helper function
 * @param[in] phy_mode_id PHY mode ID
 * @return bool true ift it's FSK PHY, otherwise false
 *****************************************************************************/
__STATIC_INLINE bool _is_fsk(const uint8_t phy_mode_id);

/**************************************************************************//**
 * @brief Is OFDM PHY
 * @details Helper function
 * @param[in] phy_mode_id PHY mode ID
 * @return bool true ift it's OFDM PHY, otherwise false
 *****************************************************************************/
__STATIC_INLINE bool _is_ofdm(const uint8_t phy_mode_id);

/**************************************************************************//**
 * @brief Check PHY mode ID
 * @details Helper function
 * @param[in] phy_mode_id PHY mode ID
 * @return bool true ift it's valid value, otherwise false
 *****************************************************************************/
__STATIC_INLINE bool _check_phy_mode(const uint8_t phy_mode);

/**************************************************************************//**
 * @brief Get PHY options (Only for FAN1.1 OFDM)
 * @details Helper function. FAN1.1 PHY mode value will be replaced with
 *          Wi-SUN specific value for first option
 * @param[in,out] phy_cfg PHY mode ID
 * @return count onf options for FAN 1.1 OFDM PHYs, otherwise 1
 *****************************************************************************/
static uint8_t _get_phy_options(sl_wisun_phy_config_t * const phy_cfg);

