CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/trace_util/sl_wisun_trace_util.c
// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

/// Application enum for PHY config type
const app_enum_t app_wisun_phy_config_type_enum[] =
{
  { "FAN 1.0", SL_WISUN_PHY_CONFIG_FAN10 },
  { "FAN 1.1", SL_WISUN_PHY_CONFIG_FAN11 },
  { "explicit", SL_WISUN_PHY_CONFIG_EXPLICIT },
  { NULL, 0 }
};

/// Application enum for connection status
const app_enum_t app_wisun_conn_status_enum[] = {
  { "Disconnected", SL_WISUN_JOIN_STATE_DISCONNECTED },
  { "Select PAN", SL_WISUN_JOIN_STATE_SELECT_PAN },
  { "Authenticate", SL_WISUN_JOIN_STATE_AUTHENTICATE },
  { "Acquire PAN Config", SL_WISUN_JOIN_STATE_ACQUIRE_PAN_CONFIG },
  { "Configure Routing", SL_WISUN_JOIN_STATE_CONFIGURE_ROUTING },
  { "Operational", SL_WISUN_JOIN_STATE_OPERATIONAL },
  { NULL, 0 }
};

/// Application enum for regulatory domains of first phy parameter
const app_enum_t app_wisun_phy_reg_domain_enum[] = {
  { "WW", SL_WISUN_REGULATORY_DOMAIN_WW },
  { "NA", SL_WISUN_REGULATORY_DOMAIN_NA },
  { "JP", SL_WISUN_REGULATORY_DOMAIN_JP },
  { "EU", SL_WISUN_REGULATORY_DOMAIN_EU },
  { "CN", SL_WISUN_REGULATORY_DOMAIN_CN },
  { "IN", SL_WISUN_REGULATORY_DOMAIN_IN },
  { "MX", SL_WISUN_REGULATORY_DOMAIN_MX },
  { "BZ", SL_WISUN_REGULATORY_DOMAIN_BZ },
  { "AZ/NZ", SL_WISUN_REGULATORY_DOMAIN_AZ },        // NZ also
  { "KR", SL_WISUN_REGULATORY_DOMAIN_KR },
  { "PH", SL_WISUN_REGULATORY_DOMAIN_PH },
  { "MY", SL_WISUN_REGULATORY_DOMAIN_MY },
  { "HK", SL_WISUN_REGULATORY_DOMAIN_HK },
  { "SG", SL_WISUN_REGULATORY_DOMAIN_SG },
  { "TH", SL_WISUN_REGULATORY_DOMAIN_TH },
  { "VN", SL_WISUN_REGULATORY_DOMAIN_VN },
  { "APPLICATION", SL_WISUN_REGULATORY_DOMAIN_APP },  // application specific domain
  { NULL, 0 }
};

/// Application enum for network size
const app_enum_t app_wisun_nw_size_enum[] = {
  { "automatic", SL_WISUN_NETWORK_SIZE_AUTOMATIC },
  { "small", SL_WISUN_NETWORK_SIZE_SMALL },
  { "medium", SL_WISUN_NETWORK_SIZE_MEDIUM },
  { "large", SL_WISUN_NETWORK_SIZE_LARGE },
  { "test", SL_WISUN_NETWORK_SIZE_TEST },
  { "certification", SL_WISUN_NETWORK_SIZE_CERTIFICATION },
  { NULL, 0 }
};

/// Application enum for regulation
const app_enum_t app_regulation_enum[] = {
  { "none", SL_WISUN_REGULATION_NONE },
  { "arib", SL_WISUN_REGULATION_ARIB },
  { "wpc", SL_WISUN_REGULATION_WPC },
  { NULL, 0 }
};

const app_enum_t app_wisun_phy_channel_spacing_enum[] = {
  { "100kHz", SL_WISUN_CHANNEL_SPACING_100HZ },
  { "200kHz", SL_WISUN_CHANNEL_SPACING_200HZ },
  { "400kHz", SL_WISUN_CHANNEL_SPACING_400HZ },
  { "600kHz", SL_WISUN_CHANNEL_SPACING_600HZ },
  { NULL, 0 }
};

const app_enum_t app_wisun_device_type_enum[] =
{
  { "FFN", SL_WISUN_ROUTER },
  { "LFN", SL_WISUN_LFN },
  { NULL, 0 }
};

const app_enum_t app_wisun_lfn_profile_enum[] =
{
  { "test", SL_WISUN_LFN_PROFILE_TEST },
  { "balanced", SL_WISUN_LFN_PROFILE_BALANCED },
  { "eco", SL_WISUN_LFN_PROFILE_ECO },
  { NULL, 0 }
};

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------

/// FSK phy mode ID to operation mode table
static const uint8_t _fsk_phy_mode_to_op_mode[FSK_PHY_MODE_TO_OPM_TABLE_SIZE] = {
  0xFF, 0x1a, 0x1b, 0x2a, 0x2b, 0x3, 0x4a, 0x4b, 0x5
};

/// Wi-SUN OFDM PHY mode ID map
static const rail_ofdm_phy_mode_id_t _ofdm_phy_map[] = {
  {
    .rail_phy_mode_id = 32,
    .wisun_phy_mode_id_min = 34,
    .wisun_phy_mode_id_max = 39
  },
  {
    .rail_phy_mode_id = 48,
    .wisun_phy_mode_id_min = 51,
    .wisun_phy_mode_id_max = 55
  },
  {
    .rail_phy_mode_id = 64,
    .wisun_phy_mode_id_min = 68,
    .wisun_phy_mode_id_max = 71
  },
  {
    .rail_phy_mode_id = 80,
    .wisun_phy_mode_id_min = 84,
    .wisun_phy_mode_id_max = 87
  }
};

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

void *app_wisun_malloc(size_t size)
{
  void *ptr = NULL;
#if defined(SL_CATALOG_FREERTOS_KERNEL_PRESENT)
  // FreeRTOS
  ptr =  pvPortMalloc(size);
#else
  // MicriumOS
  ptr = sl_malloc(size);
#endif
  return ptr;
}

void app_wisun_free(void *addr)
{
#if defined(SL_CATALOG_FREERTOS_KERNEL_PRESENT)
  // FreeRTOS
  vPortFree(addr);
#else
  // MicriumOS
  sl_free(addr);
#endif
}

const char* app_wisun_trace_util_get_ip_str(const void *const addr)
{
  char *dst = NULL;
  bool ipv6_res = false;

  if (addr == NULL) {
    return IPV6_EMPTY_STRING;
  }

  // allocate string buffer
  dst = app_wisun_malloc(IPV6_STRING_SIZE);
  if (dst == NULL) {
    return IPV6_EMPTY_STRING;
  }

  ipv6_res = ip6tos(addr, dst);  // convert address binary to text for wisun and ipv6
  return ipv6_res ? dst : IPV6_EMPTY_STRING; // dst -> success, empty string -> error;
}

const char * app_wisun_trace_util_conn_state_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_conn_status_enum, val);
}

const char * app_wisun_trace_util_reg_domain_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_phy_reg_domain_enum, val);
}

const char * app_wisun_trace_util_nw_size_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_nw_size_enum, val);
}

const char * app_wisun_trace_util_phy_cfg_type_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_phy_config_type_enum, val);
}

const char * app_wisun_trace_util_ch_spacing_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_phy_channel_spacing_enum, val);
}

const char * app_wisun_trace_util_profile_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_phy_config_type_enum, val);
}

const char * app_wisun_trace_util_device_type_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_device_type_enum, val);
}

const char * app_wisun_trace_util_lfn_profile_to_str(const uint32_t val)
{
  return _get_str_key_by_val_from_enum(app_wisun_lfn_profile_enum, val);
}

app_wisun_phy_list_t *app_wisun_get_phy_list(app_wisun_phy_filter_t filter)
{
  static sl_wisun_phy_config_t phy_cfg = { 0U };
  app_wisun_phy_list_t *head    = NULL;
  app_wisun_phy_list_t *tail    = NULL;
  app_wisun_phy_list_t *p       = NULL;
  sl_status_t status            = SL_STATUS_OK;
  bool filter_res               = false;
  uint8_t phy_option_cnt        = 0U;

  // Iterate channel configs
  for (uint16_t idx = 0U; channelConfigs[idx] != NULL; ++idx) {
    // Iterate channel config entries
    for (uint16_t ch_entry_idx = 0U; ch_entry_idx < channelConfigs[idx]->length; ++ch_entry_idx) {
      // Get PHY CFG
      status = _get_phy_cfg_from_ch_cfg_entry(&channelConfigs[idx]->configs[ch_entry_idx], &phy_cfg);
      if (status != SL_STATUS_OK) {
        continue;
      }

      // Get count of PHY options. Only FAN1.1 OFDM PHYs has more options
      phy_option_cnt = _get_phy_options(&phy_cfg);
      for (uint8_t opt = 0U; opt < phy_option_cnt; ++opt) {
        if (filter != NULL) {
          filter_res = filter(&phy_cfg);
          if (!filter_res) {
            continue;
          }
        }

        // first element in the list
        if (head == NULL) {
          __alloc_phy_list_element_and_check(head, &phy_cfg);
          continue;
        }

