CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/trace_util/sl_wisun_trace_util.c
        // allocate new element
        __alloc_phy_list_element_and_check(p, &phy_cfg);

        // move tail to end of the list
        tail = head;
        while (tail->next != NULL) {
          tail = tail->next;
        }
        tail->next = p;

        // increment PHY mode id for FAN11 OFDM PHYs
        if (phy_cfg.type == SL_WISUN_PHY_CONFIG_FAN11) {
          ++phy_cfg.config.fan11.phy_mode_id;
        }
      }
    }
  }

  return head;
}

app_wisun_phy_list_t *app_wisun_filter_phy_list(app_wisun_phy_list_t *list,
                                                app_wisun_phy_filter_t filter)
{
  app_wisun_phy_list_t *head = NULL;
  app_wisun_phy_list_t *tail = NULL;
  app_wisun_phy_list_t *p    = NULL;

  if (list == NULL || filter == NULL) {
    return NULL;
  }

  for (app_wisun_phy_list_t *iter = list; iter != NULL; iter = iter->next) {
    if (!filter(&iter->phy_cfg)) {
      continue;
    }

    // first element in the list
    if (head == NULL) {
      __alloc_phy_list_element_and_check(head, &iter->phy_cfg);
      continue;
    }

    // allocate new element
    __alloc_phy_list_element_and_check(p, &iter->phy_cfg);

    // move tail to end of the list
    tail = head;
    while (tail->next != NULL) {
      tail = tail->next;
    }
    tail->next = p;
  }

  return head;
}

void app_wisun_destroy_phy_list(app_wisun_phy_list_t * list)
{
  app_wisun_phy_list_t *tmp = NULL;
  while (list != NULL) {
    tmp = list;
    list = list->next;
    app_wisun_free((void *)tmp->name);
    app_wisun_free((void *)tmp);
  }
}

const char *app_wisun_phy_to_str(sl_wisun_phy_config_t *phy_cfg)
{
  char *str = NULL;

  str = app_wisun_malloc(PHY_STR_MAX_LENGTH);

  if (str == NULL) {
    return NULL;
  }

  if (phy_cfg->type == SL_WISUN_PHY_CONFIG_FAN10) {
    snprintf(str, PHY_STR_MAX_LENGTH, FAN10_FORMAT_STR,
             app_wisun_trace_util_reg_domain_to_str(phy_cfg->config.fan10.reg_domain),
             phy_cfg->config.fan10.op_class,
             phy_cfg->config.fan10.op_mode,
             FAN_1_0_STR);
  } else if (phy_cfg->type == SL_WISUN_PHY_CONFIG_FAN11) {
    snprintf(str, PHY_STR_MAX_LENGTH, FAN11_FORMAT_STR,
             app_wisun_trace_util_reg_domain_to_str(phy_cfg->config.fan11.reg_domain),
             phy_cfg->config.fan11.chan_plan_id,
             phy_cfg->config.fan11.phy_mode_id,
             FAN_1_1_STR);
  } else {
    app_wisun_free(str);
  }

  return (const char *) str;
}

const char *app_wisun_mac_addr_to_str(const sl_wisun_mac_address_t *mac_addr)
{
  char *buf = NULL;

  buf = app_wisun_malloc(MAC_ADDR_STR_LEN + 1);
  if (buf == NULL) {
    return NULL;
  }

  snprintf(buf, MAC_ADDR_STR_LEN + 1,
           "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
           mac_addr->address[0],
           mac_addr->address[1],
           mac_addr->address[2],
           mac_addr->address[3],
           mac_addr->address[4],
           mac_addr->address[5],
           mac_addr->address[6],
           mac_addr->address[7]);
  return (const char *)buf;
}

#if !defined(SL_CATALOG_WISUN_NCP_PRESENT)
const sl_wisun_connection_params_t *sl_wisun_get_conn_param_by_nw_size(const sl_wisun_network_size_t nw_size)
{
  switch (nw_size) {
    // Small
    case SL_WISUN_NETWORK_SIZE_SMALL:
      return &SL_WISUN_PARAMS_PROFILE_SMALL;

    // Medium
    case SL_WISUN_NETWORK_SIZE_MEDIUM:
      return &SL_WISUN_PARAMS_PROFILE_MEDIUM;

    // Large
    case SL_WISUN_NETWORK_SIZE_LARGE:
      return &SL_WISUN_PARAMS_PROFILE_LARGE;

    // Test
    case SL_WISUN_NETWORK_SIZE_TEST:
      return &SL_WISUN_PARAMS_PROFILE_TEST;

    // Certifacete and automatic size are not supported
    default:
      return NULL;
  }
}
#endif

void app_wisun_trace_util_timestamp_init(const uint64_t time_ms,
                                         sl_wisun_trace_util_time_t * const time)
{
  uint64_t remaining_seconds = 0U;

  time->tot_milisecs = time_ms;

  remaining_seconds = time_ms / MS_IN_SEC;
  time->days = (uint16_t)(remaining_seconds / SEC_IN_DAY);

  remaining_seconds -= (time->days * SEC_IN_DAY);
  time->hours = (uint8_t)(remaining_seconds / SEC_IN_HOUR);

  remaining_seconds -= (time->hours * SEC_IN_HOUR);
  time->minutes = (uint8_t)(remaining_seconds / SEC_IN_MINUTE);

  remaining_seconds -= (time->minutes * SEC_IN_MINUTE);
  time->seconds = (uint8_t)remaining_seconds;
}

const char *app_wisun_trace_util_time_to_str(const sl_wisun_trace_util_time_t * const time)
{
  char *str = NULL;

  str = app_wisun_malloc(TIMESTAMP_BUF_LEN);

  if (str == NULL) {
    return NULL;
  }

  (void) snprintf(str, TIMESTAMP_BUF_LEN, TIMESTAMP_FORMAT,
                  time->days, time->hours, time->minutes, time->seconds);

  return (const char *) str;
}

sl_status_t app_wisun_trace_util_evt_notify_init(app_wisun_trace_util_evt_notify_t * const evt_notify,
                                                 const uint32_t wait_opt)
{
  static const osEventFlagsAttr_t evt_attr = {
    .name = "EvtNotify",
    .cb_mem = NULL,
    .cb_size = 0,
    .attr_bits = 0
  };

  if (evt_notify == NULL) {
    return SL_STATUS_FAIL;
  }

  evt_notify->evt_chs = 0UL;
  evt_notify->wait_opt = wait_opt;
  evt_notify->evt_id = osEventFlagsNew(&evt_attr);

  if (evt_notify->evt_id == NULL) {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

sl_status_t app_wisun_trace_util_evt_notify_clear(app_wisun_trace_util_evt_notify_t * const evt_notify)
{
  uint32_t flags = 0UL;

  flags = osEventFlagsClear(evt_notify->evt_id, APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ALL_FLAGS_MSK);

  if (flags & APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ERROR_MSK) {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

sl_status_t app_wisun_trace_util_evt_notify_subscribe_ch(app_wisun_trace_util_evt_notify_t * const evt_notify,
                                                         uint8_t * const evt_ch)
{
  for (uint8_t ch_idx = 0; ch_idx < APP_WISUN_TRACE_UTIL_EVT_NOTIFY_MAX_CHS; ch_idx++) {
    if (!(evt_notify->evt_chs & (1UL << ch_idx))) {
      *evt_ch = ch_idx;
      evt_notify->evt_chs |= (1UL << ch_idx);
      return SL_STATUS_OK;
    }
  }
  return SL_STATUS_FAIL;
}

sl_status_t app_wisun_trace_util_evt_notify_unsubscribe_ch(app_wisun_trace_util_evt_notify_t * const evt_notify,
                                                           const uint8_t evt_ch)
{
  if (!(evt_notify->evt_chs & (1UL << evt_ch))) {
    return SL_STATUS_FAIL;
  }

  (void) osEventFlagsClear(evt_notify->evt_id, 1UL << evt_ch);
  evt_notify->evt_chs &= ~(1UL << evt_ch);

