CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/trace_util/sl_wisun_trace_util.c
  return SL_STATUS_OK;
}

sl_status_t app_wisun_trace_util_evt_notfiy_chs(const app_wisun_trace_util_evt_notify_t * const evt_notify)
{
  uint32_t flags = 0UL;

  flags = osEventFlagsSet(evt_notify->evt_id, evt_notify->evt_chs);

  if (flags & APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ERROR_MSK) {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

sl_status_t app_wisun_trace_util_evt_notify_wait(const app_wisun_trace_util_evt_notify_t * const evt_notify,
                                                 const uint32_t ch_mask,
                                                 const uint32_t timeout)
{
  uint32_t flags = 0UL;

  if (!(evt_notify->evt_chs & ch_mask)) {
    return SL_STATUS_FAIL;
  }

  flags = osEventFlagsWait(evt_notify->evt_id, ch_mask, evt_notify->wait_opt, timeout);

  if (flags & APP_WISUN_TRACE_UTIL_EVT_NOTIFY_ERROR_MSK) {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------

static const char *_get_str_key_by_val_from_enum(const app_enum_t * const app_enum,
                                                 const uint32_t val)
{
  const app_enum_t *p = NULL;

  p = app_enum;
  while (p->value_str != NULL) {
    if (p->value == val) {
      return p->value_str;
    }
    ++p;
  }
  return NULL;
}

static app_wisun_phy_list_t *_alloc_phy_list_element(sl_wisun_phy_config_t *phy_cfg)
{
  app_wisun_phy_list_t *p = NULL;

  p = app_wisun_malloc(sizeof(app_wisun_phy_list_t));
  if (p == NULL) {
    return NULL;
  }

  p->name = app_wisun_phy_to_str(phy_cfg);
  memcpy(&p->phy_cfg, phy_cfg, sizeof(sl_wisun_phy_config_t));
  p->next = NULL;
  return p;
}

static sl_status_t _get_phy_cfg_from_ch_cfg_entry(const RAIL_ChannelConfigEntry_t * const ch_config_entry,
                                                  sl_wisun_phy_config_t * const phy_config)
{
  const uint8_t *stack_info = NULL;
  uint8_t phy_mode = 0U;
  uint8_t phy_type = 0U;

  if (ch_config_entry == NULL) {
    return SL_STATUS_FAIL;
  }

  stack_info = ch_config_entry->stackInfo;
  if (stack_info[0] != RAIL_PTI_PROTOCOL_WISUN) {
    // Not a Wi-SUN configuration
    return SL_STATUS_FAIL;
  }

  phy_type = _get_phy_type(stack_info[1]);
  phy_mode = _get_phy_mode(stack_info[1]);

  switch (stack_info[2]) {
    case VERSION_WISUN_FAN1_0:
      if (!_is_fsk(stack_info[1]) || !_check_phy_mode(phy_mode)) {
        return SL_STATUS_FAIL;
      }
      phy_config->type = SL_WISUN_PHY_CONFIG_FAN10;
      phy_config->config.fan10.reg_domain = stack_info[4];
      phy_config->config.fan10.op_class = stack_info[3];
      phy_config->config.fan10.op_mode = _fsk_phy_mode_to_op_mode[phy_mode];
      phy_config->config.fan10.fec = phy_type == PHY_TYPE_FSK_FEC;
      break;
    case VERSION_WISUN_FAN1_1:
      if (!(_is_fsk(stack_info[1]) || _is_ofdm(stack_info[1]))) {
        return SL_STATUS_FAIL;
      }
      phy_config->type = SL_WISUN_PHY_CONFIG_FAN11;
      phy_config->config.fan11.reg_domain = stack_info[4];
      phy_config->config.fan11.chan_plan_id = stack_info[3];
      phy_config->config.fan11.phy_mode_id = stack_info[1];
      break;
    default:
      // Unsupported version.
      return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

__STATIC_INLINE uint8_t _get_phy_type(const uint8_t phy_mode_id)
{
  return (phy_mode_id >> 4U) & 0x0FU;
}

__STATIC_INLINE uint8_t _get_phy_mode(const uint8_t phy_mode_id)
{
  return phy_mode_id & 0x0FU;
}

__STATIC_INLINE bool _is_fsk(const uint8_t phy_mode_id)
{
  return (bool)((_get_phy_type(phy_mode_id) == PHY_TYPE_FSK)
                || (_get_phy_type(phy_mode_id) == PHY_TYPE_FSK_FEC));
}

__STATIC_INLINE bool _is_ofdm(const uint8_t phy_mode_id)
{
  return (bool)((_get_phy_type(phy_mode_id) >= PHY_TYPE_OFDM1)
                && (_get_phy_type(phy_mode_id) <= PHY_TYPE_OFDM4));
}

__STATIC_INLINE bool _check_phy_mode(const uint8_t phy_mode)
{
  return (bool)(phy_mode >= PHY_MODE_MIN_VAL && phy_mode <= PHY_MODE_MAX_VAL);
}

static uint8_t _get_phy_options(sl_wisun_phy_config_t * const phy_cfg)
{
  uint8_t phy_option_cnt = 1U;

  if (phy_cfg->type != SL_WISUN_PHY_CONFIG_FAN11) {
    return phy_option_cnt;
  }

  for (uint32_t map_idx = 0; map_idx < (sizeof(_ofdm_phy_map) / sizeof(rail_ofdm_phy_mode_id_t)); ++map_idx) {
    if (phy_cfg->config.fan11.phy_mode_id == _ofdm_phy_map[map_idx].rail_phy_mode_id) {
      // Corrigate first PHY mode ID
      phy_cfg->config.fan11.phy_mode_id = _ofdm_phy_map[map_idx].wisun_phy_mode_id_min;
      return _ofdm_phy_map[map_idx].wisun_phy_mode_id_max - _ofdm_phy_map[map_idx].wisun_phy_mode_id_min + 1U;
    }
  }

  return phy_option_cnt;
}
